In [1]:
import pandas as pd

In [2]:
quijote_mywc = pd.read_csv('salidas/salida_quijote_my.txt',sep='\t', header=None,quotechar="'", names=['Word', 'Count'])
quijote_example = pd.read_csv('salidas/salida_quijote_ejemplo.txt',sep='\t', header=None,quotechar="'", names=['Word', 'Count'])

## My Word Count

In [3]:
print('Total size My Word Count',len(quijote_mywc))
quijote_mywc.head()

Total size My Word Count 7492

      Word  Count
0        a   1428
1       aa      1
2  abadejo      2
3   abades      1
4    abajo     11

In [4]:
# Ejercicio 3.4
top10 = quijote_mywc.sort_values(by='Count',ascending=False)[:10]
top10

     Word  Count
5662  que   3055
1887   de   2816
7429    y   2585
0       a   1428
3942   la   1423
2544   el   1232
2582   en   1155
4752   no    916
6305   se    753
4204  los    696

In [5]:
# Ejercicio 3.5 
dijo = quijote_mywc[quijote_mywc['Word'] == 'dijo']
dijo

      Word  Count
2326  dijo    272

## Example Word Count

In [6]:
print('Total size Example Word Count',len(quijote_example))
quijote_example.head()

Total size Example Word Count 10532

         Word  Count
0     "Apenas      1
1  "Caballero      4
2      "Conde      1
3        "Ea,      1
4     "Miau",      1

In [7]:
# Ejercicio 3.6
top10 = quijote_example.sort_values(by='Count',ascending=False)[:10]
top10

      Word  Count
8146   que   2975
3309    de   2780
10366    y   2479
5903    la   1406
969      a   1401
4143    el   1177
4198    en   1119
6961    no    822
8900    se    753
6238   los    688

In [8]:
dijo = quijote_example[quijote_example['Word'] == 'dijo']
dijo

      Word  Count
3877  dijo    197